# Pandas Serisi Oluşturmak

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
seri = pd.Series([1,2,3,4,5])

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [6]:
seri.dtype

dtype('int64')

In [7]:
seri.size

5

In [8]:
seri.ndim

1

In [9]:
seri.values

array([1, 2, 3, 4, 5], dtype=int64)

In [10]:
seri.head(3) # yazılan sayı kadar veriyi gösterir (yazılmazsa ilk 5 veriyi gösterir)

0    1
1    2
2    3
dtype: int64

In [12]:
seri.tail(3) # sondan gösterir

2    3
3    4
4    5
dtype: int64

In [13]:
pd.Series([99,22,33,94,5])

0    99
1    22
2    33
3    94
4     5
dtype: int64

In [14]:
pd.Series([99,22,33,94,5],index=[1,3,5,7,9])

1    99
3    22
5    33
7    94
9     5
dtype: int64

In [17]:
seri=pd.Series([99,22,33,94,5],index=["a","b","c","d","e"])

In [19]:
seri["a":"c"]

a    99
b    22
c    33
dtype: int64

In [20]:
sozluk = {"reg":10,"log":11,"cart":12}

In [21]:
seri = pd.Series(sozluk)

In [22]:
seri

reg     10
log     11
cart    12
dtype: int64

In [23]:
#Seri birleştirme

In [24]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

# Eleman işlemleri

In [25]:
import numpy as np
a = np.array([1,2,3,4,5])

In [26]:
seri = pd.Series(a)

In [27]:
seri

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [28]:
seri[0]

1

In [29]:
seri[0:3]

0    1
1    2
2    3
dtype: int32

In [30]:
seri = pd.Series([121,200,150,99],
                 index=["reg","loj","cart","rf"])

In [31]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [32]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [33]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [34]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [35]:
seri.values

array([121, 200, 150,  99], dtype=int64)

In [37]:
# eleman sorgulama

In [38]:
"reg" in seri

True

In [39]:
"a" in seri

False

In [40]:
seri["reg"]

121

In [41]:
#facy elemanı

In [42]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [43]:
seri["reg":"loj"]

reg    121
loj    200
dtype: int64

# Pandas DataFrame Oluşturma

In [44]:
l = [1,2,35,544,9094]
l

[1, 2, 35, 544, 9094]

In [45]:
pd.DataFrame(l,columns = ["Değişken_İsmi"])

   Değişken_İsmi
0              1
1              2
2             35
3            544
4           9094

In [46]:
m=np.arange(1,10).reshape((3,3))

In [47]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [48]:
pd.DataFrame(m,columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [49]:
# df isimlendirme

In [50]:
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [53]:
df.columns = ("deg1","deg2","deg3")

In [54]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [55]:
type(df)

pandas.core.frame.DataFrame

In [56]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [57]:
df.shape

(3, 3)

In [58]:
df.ndim

2

In [59]:
df.size

9

In [60]:
df.values # np array formuna dönüştü

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [61]:
type(df.values)

numpy.ndarray

In [64]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [65]:
a = np.array([1,2,3,4,5])

In [66]:
pd.DataFrame(a,columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

# DataFrame Eleman İşlemleri

In [82]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [83]:
sozluk = {"var1": s1 , "var2":s2,"var3":s3}

In [84]:
sozluk

{'var1': array([8, 3, 3, 8, 0]),
 'var2': array([4, 9, 9, 4, 0]),
 'var3': array([6, 8, 5, 1, 5])}

In [85]:
df=pd.DataFrame(sozluk)
df

   var1  var2  var3
0     8     4     6
1     3     9     8
2     3     9     5
3     8     4     1
4     0     0     5

In [86]:
df[0:1]

   var1  var2  var3
0     8     4     6

In [87]:
df.index = ["a","b","c","d","e"]

In [88]:
df

   var1  var2  var3
a     8     4     6
b     3     9     8
c     3     9     5
d     8     4     1
e     0     0     5

In [89]:
df["c":"e"]

   var1  var2  var3
c     3     9     5
d     8     4     1
e     0     0     5

In [90]:
# Silme

In [91]:
df.drop("a", axis = 0 , inplace = True) #inplace kalıcı silmek için kullanılır

In [92]:
df

   var1  var2  var3
b     3     9     8
c     3     9     5
d     8     4     1
e     0     0     5

In [ ]:
#fancy

In [93]:
l = ["c","e"]

In [94]:
df.drop(l,axis=0)

   var1  var2  var3
b     3     9     8
d     8     4     1

In [95]:
"var1" in df

True

In [96]:
l = ["var1","var2","var3","var4"]

In [97]:
for i in l:
    print(i in df)

True
True
True
False

In [98]:
df["var4"] = df["var1"] / df["var2"]

In [99]:
df

   var1  var2  var3      var4
b     3     9     8  0.333333
c     3     9     5  0.333333
d     8     4     1  2.000000
e     0     0     5       NaN

In [101]:
df.drop("var4", axis=1,inplace=True)

In [102]:
df

   var1  var2  var3
b     3     9     8
c     3     9     5
d     8     4     1
e     0     0     5

In [103]:
l = ["var1","var2"]

In [104]:
df.drop(l, axis=1)

   var3
b     8
c     5
d     1
e     5

# Gözlem ve Değişken Seçimi: loc ve iloc

In [2]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30,size = (10,3))
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    25     4     6
1    17    22    20
2    24     9    27
3     4     6    26
4    16    24    12
5    28    23    14
6    25    10    26
7    10    10    19
8    29     3    12
9    26    18    24

In [3]:
# loc: Tanımlandığı şekliyle seçim yapmak için kullanılır

In [4]:
df.loc[0:3]

   var1  var2  var3
0    25     4     6
1    17    22    20
2    24     9    27
3     4     6    26

In [5]:
# iloc: Alışık olduğumuz indexleme mantığıyla seçim yapar

In [6]:
df.iloc[0:3]

   var1  var2  var3
0    25     4     6
1    17    22    20
2    24     9    27

In [7]:
df.loc[0:3,"var3"]

0     6
1    20
2    27
3    26
Name: var3, dtype: int32

In [10]:
df.iloc[0:3,1:2]

   var2
0     4
1    22
2     9

# Koşullu Eleman İşlemleri

In [11]:
df["var1"]

0    25
1    17
2    24
3     4
4    16
5    28
6    25
7    10
8    29
9    26
Name: var1, dtype: int32

In [12]:
df["var1"][0:2]

0    25
1    17
Name: var1, dtype: int32

In [14]:
df[0:2][["var1","var2"]]

   var1  var2
0    25     4
1    17    22

In [16]:
df[0:2]["var1"]

0    25
1    17
Name: var1, dtype: int32

In [21]:
df[df.var1>20]

   var1  var2  var3
0    25     4     6
2    24     9    27
5    28    23    14
6    25    10    26
8    29     3    12
9    26    18    24

In [22]:
df[df.var1>20]["var1"]

0    25
2    24
5    28
6    25
8    29
9    26
Name: var1, dtype: int32

In [24]:
df[(df.var1<20)&(df.var1>5)]

   var1  var2  var3
1    17    22    20
4    16    24    12
7    10    10    19

In [25]:
df.loc[(df.var1>15),["var1","var2"]]

   var1  var2
0    25     4
1    17    22
2    24     9
4    16    24
5    28    23
6    25    10
8    29     3
9    26    18

# Birleştirme (Joint)

In [27]:
m = np.random.randint(1,30,size = (5,3))
df1 = pd.DataFrame(m,columns = ["var1","var2","var3"])

In [28]:
df1

   var1  var2  var3
0     6    29     7
1    16    21     4
2    18     3    23
3    29    18     2
4    21     1    23

In [29]:
df2 = df1 + 99

In [30]:
df2

   var1  var2  var3
0   105   128   106
1   115   120   103
2   117   102   122
3   128   117   101
4   120   100   122

In [31]:
pd.concat([df1,df2])

   var1  var2  var3
0     6    29     7
1    16    21     4
2    18     3    23
3    29    18     2
4    21     1    23
0   105   128   106
1   115   120   103
2   117   102   122
3   128   117   101
4   120   100   122

In [33]:
pd.concat([df1,df2],ignore_index = True)

   var1  var2  var3
0     6    29     7
1    16    21     4
2    18     3    23
3    29    18     2
4    21     1    23
5   105   128   106
6   115   120   103
7   117   102   122
8   128   117   101
9   120   100   122

In [36]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [38]:
df2.columns = ["var1","var2","deg3"]

In [39]:
df2

   var1  var2  deg3
0   105   128   106
1   115   120   103
2   117   102   122
3   128   117   101
4   120   100   122

In [40]:
pd.concat([df1,df2])

C:\Users\asus\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    deg3  var1  var2  var3
0    NaN     6    29   7.0
1    NaN    16    21   4.0
2    NaN    18     3  23.0
3    NaN    29    18   2.0
4    NaN    21     1  23.0
0  106.0   105   128   NaN
1  103.0   115   120   NaN
2  122.0   117   102   NaN
3  101.0   128   117   NaN
4  122.0   120   100   NaN

In [41]:
pd.concat([df1,df2],join="inner")

   var1  var2
0     6    29
1    16    21
2    18     3
3    29    18
4    21     1
0   105   128
1   115   120
2   117   102
3   128   117
4   120   100

In [43]:
pd.concat([df1,df2],join_axes=[df2.columns],ignore_index=True)

C:\Users\asus\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  var2   deg3
0     6    29    NaN
1    16    21    NaN
2    18     3    NaN
3    29    18    NaN
4    21     1    NaN
5   105   128  106.0
6   115   120  103.0
7   117   102  122.0
8   128   117  101.0
9   120   100  122.0

# İleri Birleştirme İşlemleri

In [45]:
df3=pd.DataFrame({"calisanlar":["Ali","Veli","Ayse","Fatma"],
                 "Grup":["Muhasebe","Mühendislik","Mühendislik","İK"]})
df3

  calisanlar         Grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse  Mühendislik
3      Fatma           İK

In [46]:
df4=pd.DataFrame({"calisanlar":["Ali","Veli","Ayse","Fatma"],
                 "ilk_giris":[2010,2009,2014,2019]})
df4

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [47]:
pd.merge(df3,df4)

  calisanlar         Grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Mühendislik       2009
2       Ayse  Mühendislik       2014
3      Fatma           İK       2019

In [48]:
pd.merge(df3,df4, on = "calisanlar")

  calisanlar         Grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Mühendislik       2009
2       Ayse  Mühendislik       2014
3      Fatma           İK       2019

In [49]:
# çoktan teke

In [52]:
df5 = pd.merge(df3,df4)

In [53]:
df5

  calisanlar         Grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Mühendislik       2009
2       Ayse  Mühendislik       2014
3      Fatma           İK       2019

In [61]:
df6 = pd.DataFrame({"Grup":["Muhasebe","Mühendislik","İK"],
                 "mudur":["Caner","Mustafa","Berkcan"]})

In [62]:
df6

          Grup    mudur
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           İK  Berkcan

In [63]:
pd.merge(df5,df6)

  calisanlar         Grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Mühendislik       2009  Mustafa
2       Ayse  Mühendislik       2014  Mustafa
3      Fatma           İK       2019  Berkcan

In [64]:
# Çoktan çoka

In [65]:
df7 = pd.DataFrame({"Grup":["Muhasebe","Muhasebe","Mühendislik","Mühendislik","İK","İK"],
                 "yetenek":["matematik","excel","kodlama","linux","excel","yönetiim"]})

In [66]:
df7

          Grup    yetenek
0     Muhasebe  matematik
1     Muhasebe      excel
2  Mühendislik    kodlama
3  Mühendislik      linux
4           İK      excel
5           İK   yönetiim

In [67]:
pd.merge(df3,df7)

  calisanlar         Grup    yetenek
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Mühendislik    kodlama
3       Veli  Mühendislik      linux
4       Ayse  Mühendislik    kodlama
5       Ayse  Mühendislik      linux
6      Fatma           İK      excel
7      Fatma           İK   yönetiim

# toplulaştırma ve Gruplama (Aggregation and Grouping)
Basit toplulaştırma fonksiyonları:
    
    * count()
    * first()
    * last()
    * mean()
    * median()
    * min()
    * max()
    * std()
    * var()
    * sum()

In [69]:
import seaborn as sns # dataseti kütüphanesi

In [70]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [71]:
df.shape

(1035, 6)

In [73]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [74]:
df["mass"].mean()

2.6381605847953233

In [75]:
df["mass"].max()

25.0

In [76]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [77]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [79]:
df.dropna().describe().T # eksik değerleri siler

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# Gruplama İşlemleri

In [87]:
dff = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "veri":[10,11,53,43,34,26]},columns=["gruplar","veri"])
dff

  gruplar  veri
0       A    10
1       B    11
2       C    53
3       A    43
4       B    34
5       C    26

In [89]:
dff.groupby("gruplar")

In [91]:
dff.groupby("gruplar").mean()

         veri
gruplar
A        26.5
B        22.5
C        39.5

In [92]:
dff.groupby("gruplar").sum()

         veri
gruplar
A          53
B          45
C          79

In [93]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [94]:
df.groupby("method")

In [95]:
df.groupby("method")["orbital_period"]

In [96]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

# İleri Toplulaştırma İşlemleri (AGGREGATE,Filter,Apply)

In [100]:
df = pd.DataFrame({"Gruplar":["A","B","C","A","B","C"],
                  "Degisken1":[10,20,30,40,50,60],
                  "Degisken2":[70,80,90,100,110,120]},
                 columns = ["Gruplar","Degisken1","Degisken2"])

In [101]:
df

  Gruplar  Degisken1  Degisken2
0       A         10         70
1       B         20         80
2       C         30         90
3       A         40        100
4       B         50        110
5       C         60        120

In [102]:
#Aggrigate

In [104]:
df.groupby("Gruplar").mean()

         Degisken1  Degisken2
Gruplar
A               25         85
B               35         95
C               45        105

In [109]:
df.groupby("Gruplar").aggregate(["min",np.median,max])

        Degisken1            Degisken2
              min median max       min median  max
Gruplar
A              10     25  40        70     85  100
B              20     35  50        80     95  110
C              30     45  60        90    105  120

In [111]:
df.groupby("Gruplar").aggregate({"Degisken1":["mean"],
                                "Degisken2": ["max"]})

        Degisken1 Degisken2
             mean       max
Gruplar
A              25       100
B              35       110
C              45       120

In [117]:
def filter_func(x):
    return x["Degisken1"].std()>22

In [118]:
df.groupby("Gruplar").std()

         Degisken1  Degisken2
Gruplar
A        21.213203  21.213203
B        21.213203  21.213203
C        21.213203  21.213203

In [119]:
#Filter
df.groupby("Gruplar").filter(filter_func)

Empty DataFrame
Columns: [Gruplar, Degisken1, Degisken2]
Index: []

In [121]:
df["Degisken1"]*9

0     90
1    180
2    270
3    360
4    450
5    540
Name: Degisken1, dtype: int64

In [126]:
df_a=df.iloc[:,1:3]

In [127]:
# Transform
df_a.transform(lambda x: x-x.mean())

   Degisken1  Degisken2
0      -25.0      -25.0
1      -15.0      -15.0
2       -5.0       -5.0
3        5.0        5.0
4       15.0       15.0
5       25.0       25.0

In [130]:
# APPLY
df = pd.DataFrame({
                  "Degisken1":[10,20,30,40,50,60],
                  "Degisken2":[70,80,90,100,110,120]},
                 columns = ["Degisken1","Degisken2"])

In [131]:
df

   Degisken1  Degisken2
0         10         70
1         20         80
2         30         90
3         40        100
4         50        110
5         60        120

In [132]:
df.apply(np.sum)

Degisken1    210
Degisken2    570
dtype: int64

In [133]:
df.apply(np.mean)

Degisken1    35.0
Degisken2    95.0
dtype: float64

# Pivot Tablolar

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [5]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [6]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [7]:
age = pd.cut(titanic["age"],[0,18,90])

In [9]:
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [10]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

# Dış kaynaklardan Veri okumak

In [16]:
# csv okuma
pd.read_csv("reading_data/ornekcsv.csv",sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [14]:
#txt okuma
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [17]:
#excel okuma
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [18]:
df=pd.read_excel("reading_data/ornekx.xlsx")

In [19]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [22]:
pd.read_csv("reading_data/data.txt")

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]